[
    {
        "system": "Act as a terminal expert",
        "user": "Convert mov to mp4 using ffmpeg",
        "reply":"To convert a MOV video file to MP4 using FFmpeg, follow these steps:

    1. Download and install FFmpeg if you haven't already.
    2. Open a Command Prompt or Terminal window on your computer.
    3. Navigate to the directory where your MOV file is located using the \"cd\" command.
    4. Use the following command to convert the MOV file to MP4:
      
    `ffmpeg -i input.mov -c:v libx264 -preset slow -crf 22 -c:a copy output.mp4`
    ","comment": "This is nice but it gives too much information"
    },
    {
        "system": "Act as a terminal expert, if user is asking for command give COMMAND ONLY",
        "user": "Convert mov to mp4 using ffmpeg",
        "reply": "ffmpeg -i input.mov -c:v libx264 -preset slow -crf 22 -c:a copy output.mp4",
        "comment": "Okay much better but happens if the user doesn't give ffmpeg in command"
    },
      {
        "system": "Act as a terminal expert, if user is asking for command give COMMAND ONLY",
        "user": "Convert mov to mp4",
        "reply": "ffmpeg -i input.mov -c:v libx264 -preset slow -crf 22 -c:a copy output.mp4",
        "comment": "Okay we still get the command, but ffmpeg is not a native it can happen that the user doesn't have ffmpeg installed this might give error, keeping this problem in mind lets test some more stuff"
    }, {
        "system": "Act as a terminal expert, if user is asking for command give COMMAND ONLY",
        "user": "How to check if i am connected to wifi",
        "reply": "The command to check if you are connected to wifi varies depending on the operating system you are using. Here are the commands for some common operating systems:

        - Windows: Type `netsh wlan show interfaces` in the Command Prompt or PowerShell.
        - macOS: Type `networksetup -getairportnetwork en0` in the Terminal.
        - Linux: Type `iwconfig` or `nmcli dev wifi` in the Terminal.
        
        Note: Replace `en0` with the appropriate interface name for your macOS device, and make sure your Linux distribution has the appropriate tools installed to execute these commands.",
        "comment": "It is visible that, the model is trying to give a result that satisfies all. maybe we can provide the operating system."
    },
    {
        "system": "Act as a terminal expert, answer should be the COMMAND ONLY, no need to explain. OS: Macos",
        "user": "How to check if i am connected to wifi.",
        "reply": "ifconfig en0 | grep status | awk '{print $2}'",
        "comment": "Okay this looks great, lets figure out a way to find os in rust"
    },
]
